{
    "projects": [
      {
        "title": "Economic Dashboard with PatchTST Time Series Forecasting",
        "type": "Machine Learning Personal Project",
        "description":"Developed a fully automated economic dashboard that predicts stock market performance using a state-of-the-art PatchTST (Patch Time Series Transformer) model. Implemented a multi-stage training pipeline with a pretraining phase using masked modeling followed by fine-tuning for specific market prediction tasks. The model architecture features patch-based time series segmentation (patch length 20, stride 10) with 4 transformer encoder layers and customized regularization (attention dropout 0.13, feed-forward dropout 0.23). Engineered an autoregressive prediction system with a 3-day horizon that iteratively feeds predictions back into the model for extended forecasting. Applied window-based RobustScaler normalization with a 1.5-year sliding window to handle outliers while preserving temporal context. The system demonstrates model performance transparency by comparing predictions from multiple timeframes (current, week-ago, and 40-days-ago) against actual market performance, allowing users to assess prediction drift and accuracy over time. The entire infrastructure runs on GitHub Actions, automatically updating economic indicators and model predictions every other day.",
        "technologies": ["PyTorch", "Hugging Face Transformers", "PatchTST", "D3.js", "pandas", "NumPy", "scikit-learn", "GitHub Actions", "Time Series Analysis", "FRED API", "Yahoo Finance", "HTML/CSS", "JavaScript"],
        "image": "images/projects/stock_market_forcast.jpg"
      },
      {
        "title": "Translation Component Development for The Translate-Inator",
        "type": "Machine Learning Academic Project",
        "description": "Contributed to a speech-to-text translation web application that enables real-time translation between English and Spanish. Implemented the MarianMT neural translation architecture with bidirectional capabilities, developed RESTful API endpoints in Flask, and created custom fine-tuning pipelines to optimize translation quality. Conducted extensive model evaluation using BERTScore metrics to quantitatively measure performance improvements, and documented the neural machine translation architecture for the team. The system handles both real-time and file-based translation while maintaining translation context between requests.",
        "technologies": ["Python", "Flask", "PyTorch", "Hugging Face Transformers", "MarianMT", "SentencePiece", "BERTScore", "RESTful API", "Git"],
        "image": "images/projects/speech_to_translate.jpg"
      },
      {
        "title": "Visual Reference Resolution Using Transfer Learning",
        "type": "Machine Learning Academic Project",
        "description": "This project uses transfer learning to identify objects in images based on natural language descriptions. I implemented a system that builds individual classifiers for each word in referring expressions, using pre-trained CLIP features combined with spatial information to understand phrases like \"sheep on the right.\" My implementation achieved approximately 50% accuracy on the test set, significantly outperforming random selection baselines of 15-18%. The project demonstrates how combining computer vision and natural language processing can enable machines to understand visual references in human language.",
        "technologies": ["PyTorch","CLIP", "Logistic Regression", "scikit-learn", "nltk","PIL", "Numpy", "Pandas","Python", "NLP"],
        "image": "images/projects/grounded-semantics.jpg"
      },
      {
        "title": "ELECTRA Language Model Pre-tuning and Fine-Tuning for Text Classification",
        "type": "Machine Learning Academic Project",
        "description": "Implemented and optimized an ELECTRA-based neural network model for text classification tasks. The project involved pre-trained an ELECTRA model weights, configuring the model architecture with appropriate hidden layers, and fine-tuning on domain-specific datasets. Addressed dimensional mismatch challenges and optimized the token representation extraction to improve classification accuracy.",
        "technologies": ["PyTorch","HuggingFace Transformers", "ELECTRA", "Python", "NLP"],
        "image": "images/projects/nlp_pretraining.jpg"
      },
      {
        "title": "BTree Based DNA Sequence Frequency Analysis",
        "type": "Academic Project",
        "description": "The GeneBankSearchBTree program takes command-line arguments to specify the B-tree file, query file, and other parameters. It then searches for DNA sequences in the B-tree index and computes their frequencies. The program utilizes a custom B-tree implementation and supports features like caching for improved performance.",
        "technologies": ["Java", "Gradle", "SQL"],
        "image": "images/projects/btree_photo.jpg"
      },
      {
        "title": "Economic Indicator & Market Risk Analytics Dashboard",
        "type": "Data Science Portfolio Project",
        "description": "Built a comprehensive financial analytics system that integrates multiple economic indicators (unemployment rates, housing metrics, interest rates, stock market performance) to detect hidden market vulnerabilities. Created custom composite metrics including Housing Stress Index, Financial Health Indicator, and Market Pressure signals that provide early warning of potential economic downturns. The dashboard compares current economic conditions against historical crisis periods to identify troubling patterns before they become apparent in traditional indicators. Features multiple time windows (30/90/150 days) for trend analysis and stress testing.",
        "technologies": ["Python", "Pandas", "NumPy", "Matplotlib", "Federal Reserve API", "Yahoo Finance API", "Jupyter Notebooks", "Time-Series Analysis", "Statistical Modeling"],
        "image": "images/projects/economic_analysis_photo.jpg"
      }
    ],
    
    "aboutMe": {
      "bio": "Computer science student at Boise State University with a 3.83 GPA, graduating Spring 2026. I specialize in Machine Learning, Sports Analytics, and Data Science with strong foundations in NLP, Linear Algebra, and Statistics. Currently pursuing a certificate in Generative AI to complement my academic coursework. Proficient in Python and Java, with working experience in R, JavaScript, HTML/CSS, C, and Go. My project experience includes fine-tuning NLP models like BERT and ELECTRA, implementing a B-Tree for gene analysis, and developing a snow prediction model using ordinal regression. I gained valuable industry experience during my Summer 2024 internship with a sports analytics startup, where I processed large datasets using Python libraries and built an RNN with TensorFlow for predicting basketball game outcomes. Looking forward to expanding my skills during my upcoming application development internship with JB Hunt Transportation in Summer 2025. Born and raised in Idaho, I'm passionate about transforming complex data into actionable insights. My goal is to establish myself in data engineering or data science roles, with long-term aspirations to advance into Machine Learning Engineering for quantitative and time series analytics.\n",
      "education": "Bachelor of Science in Computer Science with Emphasis in Machine Learning, Boise State University (Expected 2026)"
    },
    
    "skills": [
      {
        "category": "Programming Languages",
        "items": ["Python", "Java", "C", "JavaScript", "HTML/CSS", "Java", "Go"]
      },
      {
        "category": "Frameworks & Libraries",
        "items": ["TensorFlow", "Scikit-learn", "PyTorch", "Flutter", "Numpy", "Pandas", "Matplotlib", "D3.js", "Hugging Face Transformers"]
      },
      {
        "category": "Topics",
        "items": ["Fine-Tuning Language Models", "Pre-Training Language Models", "Transfer Learning", "Data Preprocessing/Cleaning", "Data Science", "Machine Learning Algorithms", "Natural Language Processing", "Web Development", "App Development"]
      },
      {
        "category": "Certifications",
        "items": ["Hands-on Training in Applied Artificial Intelligence and Machine Learning (NSF)", "Associates in Science (Boise State)", "Generative AI Certificate (Fall 2025)", "Data Science for STEM Certificate (Spring 2026)"]
      },
      {
        "category": "Courses Completed",
        "items": ["CS 436 \nNatural Language Processing", "MATH 301 \nIntroduction to Linear Algebra", "CS 133 \nIntroduction to Data Science", "CS 233 \nFoundations of Data Science", "CS 321 \nData Structures", "MATH 361 \nProbability and Statistics I"]
      }
    ],
    
    "contact": {
      "email": "flast4402@gmail.com",
      "linkedin": "https://linkedin.com/in/brycekratzer208",
      "instagram": "https://instagram.com/kratzar",
      "github": "https://github.com/Brycekratzer"
    }
  }