{
    "projects": [
      {
        "title": "ELECTRA Language Model Fine-tuning for Text Classification",
        "type": "Machine Learning Academic Project",
        "description": "Implemented and optimized an ELECTRA-based neural network model for text classification tasks. The project involved loading pre-trained ELECTRA model weights, configuring the model architecture with appropriate hidden layers, and fine-tuning on domain-specific datasets. Addressed dimensional mismatch challenges and optimized the token representation extraction to improve classification accuracy.",
        "technologies": ["PyTorch","HuggingFace Transformers", "ELECTRA", "Python", "NLP"],
        "image": "images/projects/nlp_pretraining.jpg"
      },
      {
        "title": "BTree Based DNA Sequence Frequency Analysis",
        "type": "Academic Project",
        "description": "The GeneBankSearchBTree program takes command-line arguments to specify the B-tree file, query file, and other parameters. It then searches for DNA sequences in the B-tree index and computes their frequencies. The program utilizes a custom B-tree implementation and supports features like caching for improved performance.",
        "technologies": ["Java", "Gradle", "SQL"],
        "image": "images/projects/btree_photo.jpg"
      },
      {
        "title": "Economic Indicator & Market Risk Analytics Dashboard",
        "type": "Data Science Portfolio Project",
        "description": "Built a comprehensive financial analytics system that integrates multiple economic indicators (unemployment rates, housing metrics, interest rates, stock market performance) to detect hidden market vulnerabilities. Created custom composite metrics including Housing Stress Index, Financial Health Indicator, and Market Pressure signals that provide early warning of potential economic downturns. The dashboard compares current economic conditions against historical crisis periods to identify troubling patterns before they become apparent in traditional indicators. Features multiple time windows (30/90/150 days) for trend analysis and stress testing.",
        "technologies": ["Python", "Pandas", "NumPy", "Matplotlib", "Federal Reserve API", "Yahoo Finance API", "Jupyter Notebooks", "Time-Series Analysis", "Statistical Modeling"],
        "image": "images/projects/economic_analysis_photo.jpg"
      }
    ],
    
    "aboutMe": {
      "bio": "Computer science student at Boise State University with a 3.83 GPA, graduating Spring 2026. I specialize in Machine Learning, Sports Analytics, and Data Science with strong foundations in NLP, Linear Algebra, and Statistics. Currently pursuing a certificate in Generative AI to complement my academic coursework. Proficient in Python and Java, with working experience in R, JavaScript, HTML/CSS, C, and Go. My project experience includes fine-tuning NLP models like BERT and ELECTRA, implementing a B-Tree for gene analysis, and developing a snow prediction model using ordinal regression. I gained valuable industry experience during my Summer 2024 internship with a sports analytics startup, where I processed large datasets using Python libraries and built an RNN with TensorFlow for predicting basketball game outcomes. Looking forward to expanding my skills during my upcoming application development internship with JB Hunt Transportation in Summer 2025. Born and raised in Idaho, I'm passionate about transforming complex data into actionable insights. My goal is to establish myself in data engineering or data science roles, with long-term aspirations to advance into Machine Learning Engineering for quantitative and time series analytics.\n",
      "education": "Bachelor of Science in Computer Science with Emphasis in Machine Learning, Boise State University (Expected 2026)"
    },
    
    "skills": [
      {
        "category": "Programming Languages",
        "items": ["Python", "Java", "C", "JavaScript", "HTML/CSS", "Java", "Go"]
      },
      {
        "category": "Frameworks & Libraries",
        "items": ["TensorFlow", "Scikit-learn", "PyTorch", "Flutter", "Numpy", "Pandas", "Matplotlib"]
      },
      {
        "category": "Topics",
        "items": ["Fine-Tuning Language Models", "Pre-Training Language Models", "Transfer Learning", "Data Preprocessing/Cleaning", "Data Science", "Machine Learning Algorithms", "Natural Language Processing", "Web Development", "App Development"]
      },
      {
        "category": "Certifications",
        "items": ["Hands-on Training in Applied Artificial Intelligence and Machine Learning (NSF)", "Associates in Science (Boise State)"]
      },
      {
        "category": "Courses Completed",
        "items": ["CS 436 \nNatural Language Processing", "MATH 301 \nIntroduction to Linear Algebra", "CS 133 \nIntroduction to Data Science", "CS 233 \nFoundations of Data Science", "CS 321 \nData Structures", "MATH 361 \nProbability and Statistics I"]
      }
    ],
    
    "contact": {
      "email": "flast4402@gmail.com",
      "linkedin": "https://linkedin.com/in/brycekratzer208",
      "instagram": "https://instagram.com/kratzar"
    }
  }